

namespace IS.Infrastructure.Enumerations
{
    using System.ComponentModel.DataAnnotations;

    public enum TownType
    {
        [Display(Name = "Въведи град")]
        Въведи = 0,

        [Display(Name = "Айтос")]
        Айтос = 1,

        [Display(Name = "Аксаково")]
        Аксаково = 2,

        [Display(Name = "Алфатар")]
        Алфатар = 3,

        [Display(Name = "Антоново")]
        Антоново = 4,

        [Display(Name = "Априлци")]
        Априлци = 5,

        [Display(Name = "Ардино")]
        Ардино = 6,

        [Display(Name = "Асеновград")]
        Асеновград = 7,

        [Display(Name = "Ахелой")]
        Ахелой = 8,

        [Display(Name = "Ахтопол")]
        Ахтопол = 9,

        [Display(Name = "Балчик")]
        Балчик = 10,

        [Display(Name = "Банкя")]
        Банкя = 11,

        [Display(Name = "Банско")]
        Банско = 12,

        [Display(Name = "Баня")]
        Баня = 13,

        [Display(Name = "Батак")]
        Батак = 14,

        [Display(Name = "Батановци")]
        Батановци = 15,

        [Display(Name = "Белене")]
        Белене = 16,

        [Display(Name = "Белица")]
        Белица = 17,

        [Display(Name = "Белово")]
        Белово = 18,

        [Display(Name = "Белоградчик")]
        Белоградчик = 19,

        [Display(Name = "Белослав")]
        Белослав = 20,

        [Display(Name = "Берковица")]
        Берковица = 21,

        [Display(Name = "Благоевград")]
        Благоевград = 22,

        [Display(Name = "Бобов дол")]
        Бобовдол = 23,

        [Display(Name = "Бобошево")]
        Бобошево = 24,

        [Display(Name = "Божурище")]
        Божурище = 25,

        [Display(Name = "Бойчиновци")]
        Бойчиновци = 26,

        [Display(Name = "Болярово")]
        Болярово = 27,

        [Display(Name = "Борово")]
        Борово = 28,

        [Display(Name = "Ботевград")]
        Ботевград = 29,

        [Display(Name = "Брацигово")]
        Брацигово = 30,

        [Display(Name = "Брегово")]
        Брегово = 31,

        [Display(Name = "Брезник")]
        Брезник = 32,

        [Display(Name = "Брезово")]
        Брезово = 33,

        [Display(Name = "Брусарци")]
        Брусарци = 34,

        [Display(Name = "Бургас")]
        Бургас = 35,

        [Display(Name = "Бухово")]
        Бухово = 36,

        [Display(Name = "Ахелой")]
        Българово = 37,

        [Display(Name = "Бяла (Русе)")]
        БялаРусе = 38,

        [Display(Name = "Бяла (Варна)")]
        БялаВарна = 39,

        [Display(Name = "Бяла Слатина")]
        БялаСлатина = 40,

        [Display(Name = "Бяла Черква")]
        БялаЧерква = 41,

        [Display(Name = "Варна")]
        Варна = 42,

        [Display(Name = "Велики Преслав")]
        ВеликиПреслав = 43,

        [Display(Name = "Велико Търново")]
        ВеликоТърново = 44,

        [Display(Name = "Велинград")]
        Велинград = 45,

        [Display(Name = "Ветово")]
        Ветово = 46,

        [Display(Name = "Ветрен")]
        Ветрен = 47,

        [Display(Name = "Видин")]
        Видин = 48,

        [Display(Name = "Враца")]
        Враца = 49,

        [Display(Name = "Вълчедрум")]
        Вълчедрум = 50,

        [Display(Name = "Вълчи дол")]
        ВълчиДол = 51,


        [Display(Name = "Върбица")]
        Върбица = 52,

        [Display(Name = "Вършец")]
        Вършец = 53,

        [Display(Name = "Габрово")]
        Габрово = 54,

        [Display(Name = "Генерал Тошево")]
        ГенералТошево = 55,

        [Display(Name = "Главница")]
        Главница = 56,

        [Display(Name = "Глоджево")]
        Глоджево = 57,

        [Display(Name = "Годеч")]
        Годеч = 58,

        [Display(Name = "Горна Оряховица")]
        ГорнаОряховица = 59,

        [Display(Name = "Гоце Делчев")]
        ГоцеДелчев = 60,

        [Display(Name = "Грамада")]
        Грамада = 61,

        [Display(Name = "Гулянци")]
        Гулянци = 62,

        [Display(Name = "Гурково")]
        Гурково = 63,

        [Display(Name = "Гълъбово")]
        Гълъбово = 64,

        [Display(Name = "Две могили")]
        ДвеМогили = 65,

        [Display(Name = "Дебелец")]
        Дебелец = 66,

        [Display(Name = "Девин")]
        Девин = 67,

        [Display(Name = "Девня")]
        Девня = 68,

        [Display(Name = "Джебел")]
        Джебел = 69,

        [Display(Name = "Димитровград")]
        Димитровград = 70,

        [Display(Name = "Димово")]
        Димово = 71,

        [Display(Name = "Добринище")]
        Добринище = 72,

        [Display(Name = "Добрич")]
        Добрич = 73,

        [Display(Name = "Долна баня")]
        ДолнаБаня = 74,

        [Display(Name = "Долна Митрополия")]
        ДолнаМитрополия = 75,

        [Display(Name = "Долна Оряховица")]
        ДолнаОряховица = 76,

        [Display(Name = "Долни Дъбник")]
        ДолниДъбник = 77,

        [Display(Name = "Долни Чифлик")]
        ДолниЧифлик = 78,


        [Display(Name = "Доспат")]
        Доспат = 79,

        [Display(Name = "Драгоман")]
        Драгоман = 80,

        [Display(Name = "Дряново")]
        Дряново = 81,

        [Display(Name = "Дулово")]
        Дулово = 82,

        [Display(Name = "Дунавци")]
        Дунавци = 83,

        [Display(Name = "Дупница")]
        Дупница = 84,

        [Display(Name = "Дългопол")]
        Дългопол = 85,

        [Display(Name = "Елена")]
        Елена = 86,

        [Display(Name = "Елин Пелин")]
        ЕлинПелин = 87,

        [Display(Name = "Елхово")]
        Елхово = 88,

        [Display(Name = "Етрополе")]
        Етрополе = 89,

        [Display(Name = "Завет")]
        Завет = 90,

        [Display(Name = "Земен")]
        Земен = 91,

        [Display(Name = "Златарица")]
        Златарица = 92,

        [Display(Name = "Златица")]
        Златица = 93,

        [Display(Name = "Златоград")]
        Златоград = 94,

        [Display(Name = "Ивайловград")]
        Ивайловград = 95,

        [Display(Name = "Игнатиево")]
        Игнатиево = 96,

        [Display(Name = "Искър")]
        Искър = 97,

        [Display(Name = "Исперих")]
        Исперих = 98,

        [Display(Name = "Ихтиман")]
        Ихтиман = 99,

        [Display(Name = "Каблешково")]
        Каблешково = 100,

        [Display(Name = "Каварна")]
        Каварна = 101,

        [Display(Name = "Казанлък")]
        Казанлък = 102,

        [Display(Name = "Калофер")]
        Калофер = 103,

        [Display(Name = "Камено")]
        Камено = 104,

        [Display(Name = "Каолиново")]
        Каолиново = 105,

        [Display(Name = "Карлово")]
        Карлово = 106,

        [Display(Name = "Карнобат")]
        Карнобат = 107,

        [Display(Name = "Каспичан")]
        Каспичан = 108,

        [Display(Name = "Кермен")]
        Кермен = 109,

        [Display(Name = "Килифарево")]
        Килифарево = 110,

        [Display(Name = "Китен")]
        Китен = 111,

        [Display(Name = "Клисура")]
        Клисура = 112,

        [Display(Name = "Кнежа")]
        Кнежа = 113,

        [Display(Name = "Козлодуй")]
        Козлодуй = 114,

        [Display(Name = "Койнаре")]
        Койнаре = 115,

        [Display(Name = "Копривщица")]
        Копривщица = 116,

        [Display(Name = "Костандово")]
        Костандово = 117,

        [Display(Name = "Костенец")]
        Костенец = 118,

        [Display(Name = "Костинброд")]
        Костинброд = 119,

        [Display(Name = "Котел")]
        Котел = 120,

        [Display(Name = "Кочериново")]
        Кочериново = 121,

        [Display(Name = "Кресна")]
        Кресна = 122,

        [Display(Name = "Криводол")]
        Криводол = 123,

        [Display(Name = "Кричим")]
        Кричим = 124,

        [Display(Name = "Крумовград")]
        Крумовград = 125,

        [Display(Name = "Крън")]
        Крън = 126,

        [Display(Name = "Кубрат")]
        Кубрат = 127,

        [Display(Name = "Куклен")]
        Куклен = 128,

        [Display(Name = "Кула")]
        Кула = 129,

        [Display(Name = "Кърджали")]
        Кърджали = 130,

        [Display(Name = "Кюстендил")]
        Кюстендил = 131,

        [Display(Name = "Левски")]
        Левски = 132,

        [Display(Name = "Летница")]
        Летница = 133,

        [Display(Name = "Ловеч")]
        Ловеч = 134,

        [Display(Name = "Лозница")]
        Лозница = 135,

        [Display(Name = "Лом")]
        Лом = 136,

        [Display(Name = "Луковит")]
        Луковит = 137,

        [Display(Name = "Лъки")]
        Лъки = 138,

        [Display(Name = "Любимец")]
        Любимец = 139,

        [Display(Name = "Лясковец")]
        Лясковец = 140,

        [Display(Name = "Мадан")]
        Мадан = 141,

        [Display(Name = "Маджарово")]
        Маджарово = 142,

        [Display(Name = "Малко Търново")]
        МалкоТърново = 143,

        [Display(Name = "Мартен")]
        Мартен = 144,

        [Display(Name = "Мездра")]
        Мездра = 145,

        [Display(Name = "Мелник")]
        Мелник = 146,

        [Display(Name = "Меричлери")]
        Меричлери = 147,

        [Display(Name = "Мизия")]
        Мизия = 148,

        [Display(Name = "Момин проход")]
        МоминПроход = 149,

        [Display(Name = "Момчилград")]
        Момчилград = 150,

        [Display(Name = "Монтана")]
        Монтана = 151,

        [Display(Name = "Мъглиж")]
        Мъглиж = 152,

        [Display(Name = "Неделино")]
        Неделино = 153,

        [Display(Name = "Несебър")]
        Несебър = 154,

        [Display(Name = "Николаево")]
        Николаево = 155,

        [Display(Name = "Никопол")]
        Никопол = 156,

        [Display(Name = "Нова Загора")]
        НоваЗагора = 157,

        [Display(Name = "Нови Искър")]
        НовиИскър = 158,

        [Display(Name = "Нови Пазар")]
        НовиПазар = 159,

        [Display(Name = "Обзор")]
        Обзор = 160,

        [Display(Name = "Омуртаг")]
        Омуртаг = 161,

        [Display(Name = "Опака")]
        Опака = 162,

        [Display(Name = "Оряхово")]
        Оряхово = 163,

        [Display(Name = "Павел баня")]
        ПавелБаня = 164,

        [Display(Name = "Павликени")]
        Павликени = 165,

        [Display(Name = "Пазарджик")]
        Пазарджик = 166,

        [Display(Name = "Панагюрище")]
        Панагюрище = 167,

        [Display(Name = "Перник")]
        Перник = 168,

        [Display(Name = "Перущица")]
        Перущица = 169,

        [Display(Name = "Петрич")]
        Петрич = 170,

        [Display(Name = "Пещера")]
        Пещера = 171,

        [Display(Name = "Пирдоп")]
        Пирдоп = 172,

        [Display(Name = "Плачковци")]
        Плачковци = 173,

        [Display(Name = "Плевен")]
        Плевен = 174,

        [Display(Name = "Плиска")]
        Плиска = 175,

        [Display(Name = "Пловдив")]
        Пловдив = 176,

        [Display(Name = "Полски Тръмбеш")]
        ПолскиТръмбеш = 177,

        [Display(Name = "Поморие")]
        Поморие = 178,

        [Display(Name = "Попово")]
        Попово = 179,

        [Display(Name = "Пордим")]
        Пордим = 180,

        [Display(Name = "Правец")]
        Правец = 181,

        [Display(Name = "Приморско")]
        Приморско = 182,

        [Display(Name = "Провадия")]
        Провадия = 183,

        [Display(Name = "Първомай")]
        Първомай = 184,

        [Display(Name = "Раднево")]
        Раднево = 185,

        [Display(Name = "Радомир")]
        Радомир = 186,

        [Display(Name = "Разград")]
        Разград = 187,

        [Display(Name = "Разлог")]
        Разлог = 188,

        [Display(Name = "Ракитово")]
        Ракитово = 189,

        [Display(Name = "Раковски")]
        Раковски = 190,

        [Display(Name = "Рила")]
        Рила = 191,

        [Display(Name = "Роман")]
        Роман = 192,

        [Display(Name = "Рудозем")]
        Рудозем = 193,

        [Display(Name = "Русе")]
        Русе = 194,

        [Display(Name = "Садово")]
        Садово = 195,

        [Display(Name = "Самоков")]
        Самоков = 196,

        [Display(Name = "Сандански")]
        Сандански = 197,

        [Display(Name = "Сапарева баня")]
        СапареваБаня = 198,

        [Display(Name = "Свети Влас")]
        СветиВлас = 199,

        [Display(Name = "Свиленград")]
        Свиленград = 200,

        [Display(Name = "Свищов")]
        Свищов = 201,

        [Display(Name = "Своге")]
        Своге = 202,

        [Display(Name = "Севлиево")]
        Севлиево = 203,

        [Display(Name = "Сеново")]
        Сеново = 204,

        [Display(Name = "Септември")]
        Септември = 205,

        [Display(Name = "Силистра")]
        Силистра = 206,

        [Display(Name = "Симеоновград")]
        Симеоновград = 207,

        [Display(Name = "Симитли")]
        Симитли = 208,

        [Display(Name = "Славяново")]
        Славяново = 209,

        [Display(Name = "Сливен")]
        Сливен = 210,

        [Display(Name = "Сливница")]
        Сливница = 211,

        [Display(Name = "Сливо поле")]
        СливоПоле = 212,

        [Display(Name = "Смолян")]
        Смолян = 213,

        [Display(Name = "Смядово")]
        Смядово = 214,

        [Display(Name = "Созопол")]
        Созопол = 215,

        [Display(Name = "Сопот")]
        Сопот = 216,

        [Display(Name = "София")]
        София = 217,

        [Display(Name = "Средец")]
        Средец = 218,

        [Display(Name = "Стамболийски")]
        Стамболийски = 219,

        [Display(Name = "Стара Загора")]
        СтараЗагора = 220,

        [Display(Name = "Стражница")]
        Стражница = 221,

        [Display(Name = "Стралджа")]
        Стралджа = 222,

        [Display(Name = "Стрелча")]
        Стрелча = 223,

        [Display(Name = "Суворово")]
        Суворово = 224,

        [Display(Name = "Сунгурларе")]
        Сунгурларе = 225,

        [Display(Name = "Сухиндол")]
        Сухиндол = 226,

        [Display(Name = "Съединение")]
        Съединение = 227,

        [Display(Name = "Твърдица")]
        Твърдица = 228,

        [Display(Name = "Тервел")]
        Тервел = 229,

        [Display(Name = "Тетевен")]
        Тетевен = 230,

        [Display(Name = "Тополовград")]
        Тополовград = 231,

        [Display(Name = "Троян")]
        Троян = 232,

        [Display(Name = "Трън")]
        Трън = 233,

        [Display(Name = "Тръстеник")]
        Тръстеник = 234,

        [Display(Name = "Трявна")]
        Трявна = 235,

        [Display(Name = "Тутракан")]
        Тутракан = 236,

        [Display(Name = "Търговище")]
        Търговище = 237,

        [Display(Name = "Угърчин")]
        Угърчин = 238,

        [Display(Name = "Хаджидимово")]
        Хаджидимово = 239,

        [Display(Name = "Харманли")]
        Харманли = 240,

        [Display(Name = "Хасково")]
        Хасково = 241,

        [Display(Name = "Хисаря")]
        Хисаря = 242,

        [Display(Name = "Цар Калоян")]
        ЦарКалоян = 243,

        [Display(Name = "Царево")]
        Царево = 244,

        [Display(Name = "Чепеларе")]
        Чепеларе = 245,

        [Display(Name = "Червен бряг")]
        ЧервенБряг = 246,


        [Display(Name = "Черноморец")]
        Черноморец = 247,

        [Display(Name = "Чипровци")]
        Чипровци = 248,

        [Display(Name = "Чирпан")]
        Чирпан = 249,

        [Display(Name = "Шабла")]
        Шабла = 250,

        [Display(Name = "Шивачево")]
        Шивачево = 251,

        [Display(Name = "Шипка")]
        Шипка = 252,

        [Display(Name = "Шумен")]
        Шумен = 253,

        [Display(Name = "Ябланица")]
        Ябланица = 254,

        [Display(Name = "Якоруда")]
        Якоруда = 255,

        [Display(Name = "Ямбол")]
        Ямбол = 256
    }
}
